{
  "about_me":"Hello everyone, My name is Anthony, I am a passionate programmer focusing on full-stack web development. I love learning new things, especially studying new codebases and related frameworks. I also love working on Test Driven    Development tasks to meet all the expected outputs from each stack(from back-end to front-end).",
  "role":"Web Developer",
  "projects":[{
    "image":"tons grocery image.PNG",
    "project_name":"Ton's Grocery",
    "description":"- It's a personal project that is inspired by cloning Mighty Ape. However, I’m still working on it as it has so many features to work on. Most importantly, I met my MVP(minimum viable product) to get this started.- The MVP for this project is to add an admin page (no authentication yet) and the admin can add products, upload an image of the product, and post it on the home route - I used CSS, HTML, Javascript, React.js and sqlite3",
    "tech_used":["nodejs","React.js","Sqlite3"],
    "github_url":"url1"
  },
  {
    "image":"hungry games image.PNG",
    "project_name":"Hungry Games",
    "description":"- This is one of our group projects that I worked on and this is made for users who are confused about choosing a restaurant. The main goal of this project is to give them one random restaurant to go to.- My contribution to this project is to consume an API from Google Maps API to get the specific coordinates of the location that users typed and also made a delete functionality for users to delete some locations that they don't want on the list- We used CSS, HTML, Javascript, React.js and sqlite3",
    "tech_used":["Google Maps Api","nodejs","React.js","Javascript"],
    "github_url":"url12"
  },
  {
    "image":"kanban board image.PNG",
    "project_name":"KanBan Board",
    "description":"- a simple personal project that replicates a Kanban Board where the user can add a backlog and move tasks to the next stages until it's done- I used CSS, HTML, Javascript, React.js and sqlite3",
    "tech_used":["nodejs","React.js","Javascript","Sqlite3"],
    "github_url":"url13"
  }],
  "skills":[
    {
    "technical_skills":[
      {
      "proficiency":"8/10",
      "skill":"Javascript",
      "description":"I mainly use javascript for developing my web application together with React.js for front-end and Node.js for the back-end"
      },
      {
        "proficiency":"8/10",
        "skill":"React.js",
        "description":"-I've been using react since I graduated from the bootcamp and I have a good understanding of using particular hooks like useState, useEffect, useContext, useQuery, useMutation.\n-I also use props for passing data from the parent component to its child components.\n-I also use this for routing a single page app using react-router-dom library\n- Consuming Api's using some libraries like Axios or Superagent or fetch api in javascript" 
      },
      {
        "proficiency":"8/10",
        "skill":"Node js",
        "description": "I have a good understanding how tcp/udp and application layer works to develop a good backend server and the http protocol to work with internet browsers and have a good understanding of the most concepts in node js documentation such as EventEmitters, the Http class, Tcp, Readable and Writable Streams, Buffers.\n-I took 3 more weeks to study deeper on how streams and buffer works and how and when to use it for reading and writing big chunks of data/files.\n-I also use this to interact with database and to develop API's"
      },
      {
        "proficiency":"9/10",
        "skill":"HTML",
        "description": "For structuring web pages using non-semantic and semantic elements"
      },
      {
        "proficiency":"9/10",
        "skill":"CSS",
        "description":"I mainly use CSS for designing my web application"
      },
      {
        "proficiency":"8/10",
        "skill":"SQL",
        "description":"I studied database for 4 years back from 2012 using ORACLE sql 10g(very old version) and I still use sql to create records of data on my projects. I am confident to use DDL and DML commands and make ERD(Entity Relationship Diagram) for planning the relational structure of my database."
      },
      {
        "proficiency":"8/10",
        "skill":"Git and Github",
        "description":"I've learned git and github from the bootcamp(Dev Academy Aotearoa) for version control and we normally use this to build group projects remotely and on-site"
      }
  ],
    "soft_skills":["Empathy and Listening","Self Compassion","Conflict Resolution","Giving and Receiving Feedback","Bias, Diversity and Inclusion"],
    "tools":[
      {
        "tool":"Visual Studio Code",
        "description":"I use this to write my javascript codes"
      },
      {
        "tool":"Figma",
        "description":"For designing my project"
      },
      {
        "tool":"Blisk",
        "description":"to improve design compatibility for multiple devices"       
      },
      {
        "tool":"Microsoft Sql Server",
        "description":"I use this for making sql queries whenever I host my sql database from azure or aws"
      }
    ]
    
  }
]
}